
// 날씨 관련 문구 데이터
let weatherMatching = {
    "01d" : ["해가 쨍쨍하다", "선크림 바르면 이뻐해줄게"],
    "01n" : ["밤 하늘에 구름 한 점 없다", "별똥별 떨어지나 한 번 쳐다보자"],
    "02d" : ["구름이 좀 있다","그래도 선크림 발라야 덜 늙는다"],
    "02n" : ["구름이 좀 있다","난 이런 날씨가 좋더라고"],
    "03d" : ["흐려죽겠다","분위기 꾸리꾸리한데 힙합이나 틀어봐"],
    "03n" : ["흐린 밤하늘이다","달 어디갔냐"],
    "04d" : ["먹구름이 껴있다","거참 씨꺼멓네, 집에 가고 싶다"],
    "04n" : ["먹구름이 껴있다","어서 집에 들어가, 귀신 나온다"],
    "09d" : ["소나기가 쏟아진다", "풉 내가 우산 가지고 가랬지?"],
    "09n" : ["소나기가 쏟아진다", "귀찮으니 나 부르지 말고 우산 사서 쓰고 와"],
    "10d" : ["비가 온다", "퇴근하고 파막 ㄱ?"],
    "10n" : ["비가 온다", "신발 안젖게 맨발로 퇴근하자"],
    "11d" : ["천둥 번개 친다", "괜찮아, 키 작아서 번개 안 맞아"],
    "11n" : ["천둥 번개 친다", "이제 곧 종말이 오나보다"],
    "13d" : ["눈 내린다", "1. 눈을 뭉친다, 2. 너에게 던진다"],
    "13n" : ["눈 내린다", "빙판길에 넘어지면 황천길 가는 수가 있어"],
    "50d" : ["안개 껴있다", "앞이 안보이지? 네 미래야"],
    "50n" : ["안개 껴있다", "이런날 운전하면 그게 네 마지막 운전이 될거야"]    
 }

//  forecast 인덱스에 매칭할 요일 데이터
 let day = ["일", "월", "화", "수", "목", "금", "토"];